[TRShieldGenerator X2EquipmentTemplate]
FriendlyName="护盾发生器"
FriendlyNamePlural="护盾发生器"
BriefSummary="实用物品，提供有限量的护盾再生。有助于延长士兵在战斗中的生存能力."
TacticalText="<Bullet/>为有限次数提供护盾再生.<br/><Bullet/>可与其他提供消耗性护盾点的装备配合使用." 

[TRShieldRegenAbility X2AbilityTemplate]
LocFriendlyName="护盾发生器"
LocLongDescription="护盾会再生."
LocHelpText="护盾会再生."
LocFlyOverText="护盾再生"